# KilonewtonsPerSquareCentimeter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..KilonewtonsPerSquareCentimeter Property
UnitTypeId Class See Also
---
Kilonewtons per square centimeter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KilonewtonsPerSquareCentimeter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KilonewtonsPerSquareCentimeter As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KilonewtonsPerSquareCentimeter {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace